let handler = async (m, { command, text }) => m.reply(`** ❤️‍🔥 .اهلا يا روحي معاك* *بوت اسمي جاك  ◈*

*ياريت اي امر خطأ في البوت أو يعلق معك البوت تخبرني عن طريق تقول البوت .ابلاغ و تكتب رسالتك و البوت سوف يرسلها للمطور و سوف يخدمك في اقرب وقت ممكن🐦❤️*

*〄معلومات 🤖  البوت 

*اسم البوت 🤖 |جاك|*

*〄بوت تابع ل المطور جاك*

*〄رقم المطور 👑* http://wa.me/201208386317

*〄اصدار v 3❗*

*〄وقت العمل «00:01:30»⏰*

*〄يعمل في الخاص🔒 و النقابات🎙️*
 〄━━━━━⌬(😈)⌬━━━━〄

*〄قائمه اوامر البوت🤖〄*

〄━━━━━⌬(😈)⌬━━━━〄

*〄القسم الاول الجروبات و النقابات〄*

〄━━━━━⌬(😈)⌬━━━━〄

*〄لا تنسي النقطه قبل اي أمر حتي يعمل معك بشكل صحيح*
〄━━━━━⌬(😈)⌬━━━━〄
*🌀استماره*
*يجيب لك استماره نقابتك بس كلم المطور ل اضافتها*

*🌀.منشن*
*يمنشن لك للجروب كله*

*🌀.مخفي*
*يمنشن لك للجروب كله بس بطريقه مخفيه*

*🌀.رفع*
*يرفع لك اي احد تمنشن عليه من عضو الي مشرف*

*🌀.خفض*
*ينزل لك المشرف الي عضو*

*🌀.تغيرالصوره*
*يغير لك صوره الجروب*

*🌀.لينك* 
*يجيب لك لينك الجروب*

*🌀.جروب غلق*
*يقفل الشات علي الكل ماعدا المشرفين*

*🌀.جروب فتح*
*يفتح الجروب للكل*

*🌀.احذف*
*يحذف البوت اي رساله تمنشن عليها*
〄━━━━━⌬(😈)⌬━━━━〄

*〄القسم الثاني قسم الأعضاء*

〄━━━━━⌬(😈)⌬━━━━〄

*⭐.دمج*
*يدمج لك اي ايموجي*

*⭐.جوجل*
*يبحث لك في جوجل*

*⭐.المطور*
*يعرض لك المطور بتاع البوت*

*⭐.ايات*
*يجيب لك اي ايه قرآن*

*⭐.توب*
*يجيب لك التوب علي حسب طلبك*

*⭐.منشني*
*يمنشنك*

*⭐.زخرفه*
*يزغرف لك اي نص*

*⭐.سرعه*
*يجيب لك تفاصيل السرعه*

*⭐.الشخصيه و تحط اسم*
*يخمن شخصيتك*

*⭐.بروفايلي/بروفايل/البروفايل/انا*
*يجيب لك بروفايلك ب كذا طريقه*

*⭐يوتيوب*
*يبحث لك و يجيب لك اي شي من يوتيوب*

*.⭐انطق*
*ينطق لك اي شي تكتبه*

*.⭐ترجم*
تكتب النص ب اي لغه و رح يترجم


〄━━━━━⌬(😈)⌬━━━━〄

*القسم الثالث قسم التحميل*


〄━━━━━⌬(😈)⌬━━━━〄


*.💫تيك/تيكتوك*
*تحط رابط التيك توك الي تريده و رح يحمله لك*

*.💫تطقيم/طقم*
*يجيب لك تطقيم ل ولد و بنت*

*.💫اغنيه*
*تكتب اسم الاغنيه و رح بجيبها لك*

〄━━━━━⌬(😈)⌬━━━━〄
*القسم الرابع قسم المطور*
*01208386317*

〄━━━━━⌬(😈)⌬━━━━〄

*👑.ادخل*
*البوت يدخل الجروب*

*👑.اخرج*
*البوت يخرج من الجروب*

*👑.حطها-بروفايل*
*يحط البوت الصوره لك بروفايل*

.*👑.بان*
*المطور يبند اي احد و يحرمه من البوت*

.*👑رفع-البان*
البوت يرفع البان

*👑.بان-شات*
*يحظر المطور الشات للبوت*

*👑.بان-شات-فك*
*يرجع المطور الشات للبوت*

*👑.حظر/بلوك*
*يحظر المطور و يبلكوه من استخدام البوت*

*👑.رفع-الحظر/.رفع البلوك*
*.يفك المطور الحظر أو البلوك*

*👑.اضف-اكسبي*
*يرفع المطور لفل اي احد ضاع منه*

.*👑.اضف-الماس*
*يضيف المطور الماس ل اي شخص*

*👑.بريم*
*يعطي المطور للبوت رقم اي شخص يقدر يستخدمه مثله*

〄━━━━━⌬(😈)⌬━━━━〄

*القسم الخامس قسم الالعاب*

〄━━━━━⌬(😈)⌬━━━━〄

*🕹️.اكس_او*
*يجيب لك لعبه اكس او تيك تاك تو*

*🕹️.احذف اللعبه /dlttt.*
*يحذف البوت اكس او*

*🕹️.كت*
*يجيب لك شخصيه انمي عشوائي*

*🕹️.لو*
*يسالك اسئله لو خيروك*

*🕹️.سؤال*
*يسالك اي سؤال*

*🕹️.تاج*
*يقول لك اي جمله*

*🕹️.ذكاء*
*يجيب نسبه الذكاء عشوائي ل اي شخص*

*🕹️.غباء*
*يجيب نسبه غباء اي شخص*

*🕹️.الحب*
*يجيب نسبه الحب ل اي شخص*

*🕹️.احرز*
*يجيب لك صور انمي و تحذر اسمها*

*🕹️.حظي*
*يطلع نسبه حظك عشوائي*

*🕹️.الجمال* 
*يجيب نسبه الجمال عشوائي*

〄━━━━━⌬(😈)⌬━━━━〄
*القسم السادس اوامر البنك*

〄━━━━━⌬(😈)⌬━━━━〄

*📮.التفعيل*
*.التفعيل اسمك عمرك*

*📮.لفل*
*يجيب لك البوت لفلك علي حسب تفاعلك معه*

*📮.الماسي*
*يجيب لك الماسك*

*📮.راتب* 
*يعطيك راتبك*

*📮.يومي*
*يعطيك يوميتك*

*📮.اسبوعي*
*يعطيك اسبوعك*

*📮.هجوم*
*تسرق اكسبي نقاط من الشخص الي تمنشن عليه*

*📮.الدفع*
*يجيب لك الاشياء الي تقدر تحولها*

*📮.البنك*
*يجيب لك اشياء البنك*

〄━━━━━⌬(😈)⌬━━━━〄

*القسم السابع قسم التحميل*


〄━━━━━⌬(😈)⌬━━━━〄

*🍃.يوتيوب*
*يبحث لك في يوتيوب*

*🍃.تيك/تيكتوك*
*يجيب لك اي فيديو من تيك توك*

*🍃.تطقيم*
*يجيب صوره ولد و بنت*

*🍃.اغنيه*
*يحمل لك اي اغنيه*

〄━━━━━⌬(😈)⌬━━━━〄
*القسم الثامن قسم التحويل الي*

〄━━━━━⌬(😈)⌬━━━━〄

*💌.سرقه*
*يسرق لك اي ملصق لحقوقك*

*💌.لصوره*
*يحول لك اي ملصق لصوره*

*💌.لفيديو*
*يحول اي ملصق لفيديو*

*💌.ملصق*
*يحول اي صوره ل ملصق*

*💌.ستك*
*يعمل لك لوغو ب اسمك*

*💌.ترجم*
*يترجم لك اي كلمه*

*💌.تليجراف*
*يرفع لك اي صوره تليجراف*


〄━━━━━⌬〔💻〕⌬━━━━━〄
~⌬ تــ✍︎ــوقــيــعي 
🤖┋*«JACK ALMRGAWY»*┋🤖
*╰━━━━━━━━━━━━⬣*`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['اوامر <teks>?']
handler.tags = ['اوامر', 'fun']
handler.command = /^(اوامر)$/i

export default handler